<?php
return [

    /**
     * ******************************** 地图相关配置 *************************************
     */
    'map'=>[
        'key'=>[
            'baidu'=> '',
        ]
    ],

    /**
     * ******************************** 系统公共配置 *************************************
     */
    'common'=>[

        //更新补丁配置
        'update'=>[
            //打包保存的目录
            'saveDir' => public_path('fixs')
        ],

        //允许访问IP
        'allowIp'=> [] ,

        //拒绝IP
        'denyIp' => [],
    ],

    /**
     * ******************************** 系统钩子配置 *************************************
     * 文章钩子：钩子需实现 Stars\Peace\Contracts\ArticleHook; 接口
     */
    'hook'=>[

    ],

    /**
     * ******************************** APP SEO配置 *************************************
     * 应用如果必须单独指定SEO内容，需配置此项目
     * 需继承 Stars\Peace\Foundation\PageSeoFoundation
     */
    'page'=>[
        'seo'=>""
    ],

    /**
     * ******************************** 导航简称配置 *************************************
     * 导航简称及导航ID映射配置
     * 例如：网站支持 zh,en两种语言，则使用默认配置即可，支持其他语言则以此类推即可。
     */
    'nav'=> [
        'en' => 7,
        'zh' => 2
    ],

    /**
     * ********************************** 多语言样例配置 *********************************
     */
    'zh'=>[

        //列表对应内页配置
        'inner'=> [
            'templateName' => 'detail' ,
            'delimiter'=> '.',
            'count' => 1
        ],

        //缓存配置
        'cache'=> [
            'navMenu' => 10
        ],

        //分页配置
        'paginate'=>[
            'default'=>20 ,
            'single.about.speech'=>15 ,
            'paginate.join.society'=>1,
            'paginate.news.paginate'=>3,
        ] ,

        //其他设置
        'options'=>[
            'default'=>[
                ''
            ]
        ] ,

    ],

    // 所有配置项与 zh 一样...
    'en'=>[

    ],
];
